Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Customizing Micrometer
ja_jp: Micrometer のカスタマイズ

source: Customizing Picocli CommandLine instance
ja_jp: Picocli CommandLine インスタンスのカスタマイズ

source: Customizing and overriding
ja_jp: カスタマイズとオーバーライド

source: Customizing authentication requests
ja_jp: 認証リクエストのカスタマイズ

source: Customizing headers and status
ja_jp: ヘッダーとステータスのカスタマイズ

source: Customizing individual repositories using repository fragments
ja_jp: リポジトリーフラグメントを使用した個々のリポジトリーのカスタマイズ

source: Customizing pool creation
ja_jp: プール作成のカスタマイズ

source: Customizing request cohort
ja_jp: リクエストコホートのカスタマイズ

source: Customizing request priority
ja_jp: リクエストの優先度のカスタマイズ

source: Customizing the Keycloak realm
ja_jp: Keycloak レルムのカスタマイズ

source: Customizing the ObjectMapper in REST Client Jackson
ja_jp: REST Client Jackson の ObjectMapper のカスタマイズ

source: Customizing the Redis options programmatically
ja_jp: プログラムによる Redis オプションのカスタマイズ

source: Customizing the Vert.x configuration
ja_jp: Vert.xインスタンスの設定

source: Customizing the _proto_ directory
ja_jp: _proto_ ディレクトリーのカスタマイズ

source: Customizing the authentication error response
ja_jp: 認証エラーレスポンスのカスタマイズ

source: Customizing the base repository for all repository interfaces in the code base.
ja_jp: コードベース内のすべてのリポジトリーインターフェイスのベースリポジトリーをカスタマイズします。

source: Customizing the readiness probe
ja_jp: readiness probeのカスタマイズ

source: Customizing the readiness probe:
ja_jp: rediness プローブのカスタマイズ

source: Customizing the request
ja_jp: リクエストのカスタマイズ

source: Customizing the service selection
ja_jp: サービス選択のカスタマイズ

source: Customizing the underlying AMQP client
ja_jp: 基盤となる AMQP クライアントのカスタマイズ

source: Customizing the underlying RabbitMQ client
ja_jp: 基盤となる RabbitMQ クライアントのカスタマイズ

source: D'oh.
ja_jp: なんてことだ。

source: DATABASE approach
ja_jp: データベースアプローチ

source: DB2 (container) (requires <<#license_acceptance,license acceptance>>)
ja_jp: DB2 (コンテナー) (<<#license_acceptance,license acceptance>> が必要)

source: DB2 (container) (requires license acceptance)
ja_jp: DB2 (コンテナ)(要ライセンス承諾)

source: DB2 (container) (requires xref:license_acceptance[license acceptance])
ja_jp: DB2（コンテナ）（ xref:license_acceptance[ライセンスの受諾] が必要です）

source: DB2 Client
ja_jp: DB2クライアント

source: DEPRECATED. The filter executes as if both the `BUILD` and `RUN` stages were specified.
ja_jp: 非推奨。フィルターは `BUILD` と `RUN` ステージの両方が指定された場合と同様に実行されます。

source: DEPRECATED. The filter executes at stage `RUNTIME_STARTUP` if `quarkus.smallrye-openapi.always-run-filter` is set to `false`, or at stage `RUNTIME_PER_REQUEST` if `quarkus.smallrye-openapi.always-run-filter` is set to `true`. (See also <<Advanced interactions of RunStages>>.)
ja_jp: 非推奨。 `quarkus.smallrye-openapi.always-run-filter` が `false` に設定されている場合は `RUNTIME_STARTUP` ステージで、 `quarkus.smallrye-openapi.always-run-filter` が `true` に設定されている場合は `RUNTIME_PER_REQUEST` ステージでフィルターが実行されます。(<<advanced-interactions-of-runstages,RunStages の高度な相互作用>> も参照してください。)

source: DI became predictable not magical (big win)
ja_jp: DIが魔法ではなく予測可能になりました (大勝利)

source: DIGEST-SHA-512 (default)
ja_jp: DIGEST-SHA-512（デフォルト）

source: DISCRIMINATOR approach
ja_jp: DISCRIMINATOR アプローチ

source: DMN Editor
ja_jp: DMNエディター

source: DOCUMENTATION
ja_jp: ドキュメント

source: DSAPublicKey Serialization Error
ja_jp: DSAPublicKey シリアル化エラー

source: DSAPublicKeyObjectSubstitution Example
ja_jp: DSAPublicKeyObjectSubstitution 例

source: DTO classes used by the JSON serialization layer are required to have a default no-arg constructor.
ja_jp: JSONのシリアライゼーションレイヤーで使用されるDTOクラスは、デフォルトの引数なしのコンストラクタが必要です。

source: DWARF debug info is generated in a separate file and can even be omitted in the default deployment and only be transferred and used on demand, for profiling or debugging purposes. Furthermore, the presence of debug info enables `perf` to show us the relevant source code lines as well, hence it does not bloat the native executable itself. To do that, simply call `perf report` with an extra parameter to show source code lines:
ja_jp: DWARFのデバッグ情報は、別のファイルに生成され、デフォルトのデプロイメントでは省略することもでき、プロファイリングやデバッグの目的で必要なときだけ転送して使用することができます。さらに、デバッグ情報があることで、 `perf` は関連するソースコード行も表示することができ、ネイティブ実行可能ファイル自体を肥大化させることはありません。そのためには、 `perf report` にソースコード行を表示するパラメータを追加して呼び出すだけです。

source: Data
ja_jp: データ

source: Data Source groups
ja_jp: データソースグループ

source: Data can be streamed with Multi
ja_jp: `Multi` を使用してデータをストリーミングできます

source: Data passed to the template instance are always accessible using the `data` namespace. This could be useful to access data for which the key is overridden:
ja_jp: テンプレート・インスタンスに渡されたデータは、常に `data` 名前空間を使用してアクセスできます。これは、キーがオーバーライドされているデータにアクセスするのに便利かもしれません。

source: DataStore: data source for modifiable data
ja_jp: DataStore: 変更可能なデータのデータソース

source: DataStream: an append-only data source
ja_jp: DataStream: 追加のみのデータソースです。

source: Database Clients details
ja_jp: データベースクライアントの詳細

source: Database TokenStateManager
ja_jp: データベース TokenStateManager

source: Database Vendor Specific Configuration
ja_jp: データベースベンダー固有の設定

source: Database import scripts
ja_jp: データベースインポートスクリプト

source: Database kind
ja_jp: データベースの種類

source: Database kind must be 'other' as we need to skip Quarkus auto-configuration.
ja_jp: Quarkusの自動設定をスキップする必要があるため、データベースの種類は「その他」でなければなりません。

source: Database kind to JDBC driver mapping
ja_jp: データベースの種類から JDBC ドライバーへのマッピング

source: Database kind to Reactive driver mapping
ja_jp: データベースの種類と Reactive ドライバーのマッピング

source: Database migrations
ja_jp: データベースマイグレーション

source: Database name
ja_jp: データベース名

source: Database platform kind to JDBC driver mapping
ja_jp: データベースプラットフォームの種類と JDBC ドライバーのマッピング

source: Database schema and seed data
ja_jp: データベーススキーマとシードデータ

source: Databases
ja_jp: データベース

source: Datasource Health Check
ja_jp: データソースヘルスチェック

source: Datasource Metrics
ja_jp: データソースメトリクス

source: Datasource configuration is extremely simple, but is covered in a different guide as technically it's implemented by the Agroal connection pool extension for Quarkus.
ja_jp: データソースの設定は非常にシンプルですが、技術的にはQuarkus用のAgroal接続プールエクステンションによって実装されているため、別のガイドで説明します。

source: Datasource health check
ja_jp: データソースのヘルスチェック

source: Datasource integrations
ja_jp: データソースの統合

source: Datasource metrics
ja_jp: データソースのメトリクス

source: Datasource tracing
ja_jp: データソースのトレース

source: Datasources
ja_jp: データソース

source: Datastore connections are typically pooled. When using a time limited credentials provider, the pool must be configured to recycle connections before each connection's credentials expire. Both JDBC and Reactive datasources have a `max-lifetime` configuration property that can be used to achieve this.
ja_jp: データストア接続は通常プールされます。 期間限定クレデンシャルプロバイダーを使用する場合、各接続のクレデンシャルの有効期限が切れる前に接続をリサイクルするようにプールを構成する必要があります。JDBC と Reactive データソースの両方には、これを実現するために使用できる `max-lifetime` 設定プロパティがあります。

source: Datastore events are not implemented yet.
ja_jp: データストアイベントはまだ実装されていません。

source: Date
ja_jp: 日付

source: Date and time as defined by a DateTimeFormatter compliant string
ja_jp: DateTimeFormatter 準拠の文字列で定義された日付と時刻

source: Date and time, in Common Log Format format
ja_jp: Common Log Format 形式の日時

source: Date of last resource modification
ja_jp: リソースの最終変更日

source: De-camel-cased and hyphenated; e.g. `helloName()` -> `hello-name`
ja_jp: キャメルケースを止め、ハイフン化したもの。 例: `helloName()` -> `hello-name`

source: De-camel-cased and parts separated by underscores; e.g. `helloName()` -> `hello_name`.
ja_jp: キャメルケースを止め、パーツをアンダースコア区切りとしたもの。例: `helloName()` -> `hello_name`

source: Dead letter policy for consumers. By default, some messages are probably redelivered many times, even to the extent that it never stops. By using the dead letter mechanism, messages have the max redelivery count. **When exceeding the maximum number of redeliveries, messages are sent to the Dead Letter Topic and acknowledged automatically**. You can enable the dead letter mechanism by setting `deadLetterPolicy`. When specifying the dead letter policy while not specifying `ackTimeoutMillis`, you can set the ack timeout to 30000 millisecond.
ja_jp: コンシューマー向けのデッドレター ポリシー。 デフォルトでは、一部のメッセージは何度も再配信される可能性があり、停止しないこともあります。 デッドレター メカニズムを使用すると、メッセージの再配信回数が最大になります。**再配信の最大回数を超えると、メッセージはデッドレター トピックに送信され、自動的に確認応答されます**。 デッドレター メカニズムを有効にするには、 `deadLetterPolicy` を設定します。 `ackTimeoutMillis` を指定せずにデッドレター ポリシーを指定すると、ack タイムアウトを 30000 ミリ秒に設定できます。

source: Dead-letter topic
ja_jp: デッドレタートピック

source: Dealing with Cookies
ja_jp: クッキーの取り扱い

source: Dealing with extensions
ja_jp: エクステンションへの対応

source: Dealing with messages
ja_jp: メッセージの取り扱い

source: Dealing with more than one HttpAuthenticationMechanism
ja_jp: 複数のHttpAuthenticationMechanism処理

source: Dealing with the keys
ja_jp: キーの取り扱い

source: Dealing with the verification keys
ja_jp: 検証鍵の処理

source: Dealing with verification keys
ja_jp: 検証鍵の扱い

source: Debouncing some requests to minimize heavy processing
ja_jp: 一部のリクエストをデバウンスし、重い処理を最小限に抑える

source: Debug symbol generation is only supported on Linux. Windows support is still under development, while macOS is not supported.
ja_jp: デバッグシンボルの生成は Linux でのみサポートされています。 windows は開発中です。macOS はサポートされていません。

source: Debugging
ja_jp: デバッグ

source: Debugging Filters
ja_jp: デバッグフィルター

source: Debugging Native Crashes
ja_jp: ネイティブ・クラッシュのデバッグ

source: Debugging With GDB
ja_jp: GDB によるデバッグ

source: Debugging `@QuarkusIntegrationTest`
ja_jp: `@QuarkusIntegrationTest` のデバッグ

source: Debugging a failed `@QuarkusInterationTest` is trickier than debugging a `@QuarkusTest` because the Quarkus application is launched as a separate process.
ja_jp: 失敗した `@QuarkusInterationTest` のデバッグは、Quarkus アプリケーションが別のプロセスとして起動されるため、`@QuarkusTest` のデバッグよりも困難です。

source: Debugging native executable
ja_jp: ネイティブ実行可能ファイルのデバッグ

source: Debugging native executables is hard. It has improved, but it is still a lot harder than debugging in the JVM as it requires the use of GDB and the presence of debug symbols in the build.
ja_jp: ネイティブ実行可能ファイルのデバッグは困難です。改善されてはいますが、GDB の使用とビルドにおけるデバッグシンボルの存在が必要であるため、JVM でのデバッグよりもはるかに困難です。

source: Debugging the Tracing Agent Integration
ja_jp: トレースエージェントインテグレーションのデバッグ

source: Debugging your application build
ja_jp: アプリケーションビルドのデバッグ

source: Debugging your extension
ja_jp: エクステンションのデバッグ

source: Debugging your extension tests
ja_jp: エクステンションテストのデバッグ

source: Decades of enterprise deployment ensure predictable performance and long-term maintainability.
ja_jp: 数十年にわたるエンタープライズデプロイメントにより、予測可能なパフォーマンスと長期的な保守性が保証されます。

source: Decide on a content type that best fits the content that you are contributing.
ja_jp: 投稿するコンテンツに最適なコンテンツタイプを決めます。

source: Decide on a file name. For this example, we will use `acme-serve-http-requests-tutorial.adoc`:
ja_jp: ファイル名を決めます。この例では、 `acme-serve-http-requests-tutorial.adoc` を使用します。

source: Decide on a title and file name
ja_jp: タイトルとファイル名の決定

source: Decide on a title for the tutorial. For this worked example, we will use `Serve Http requests using the Acme extension`.
ja_jp: チュートリアルのタイトルを決めます。この作業例では、 `Serve Http requests using the Acme extension` を使用します。

source: Decide on a xref:doc-concept.adoc[Diataxis] content type that best fits the content that you are contributing.
ja_jp: 投稿するコンテンツに最適な xref:doc-concept.adoc[Diataxis] のコンテンツタイプを決めましょう。

source: Deciding whether to re-use or replace a service is now link:#eligibility-for-reuse[handled centrally], based on a diff of the configuration.
ja_jp: サービスの再利用か交換かの判断は、設定の差分に基づいて link:#eligibility-for-reuse[一元的に処理] されるようになりました。

source: Decision rules as a DMN model
ja_jp: DMNモデルとしての意思決定ルール

source: Declarative approach
ja_jp: 宣言的アプローチ

source: Declaratively Choose Beans That Can Be Obtained by Programmatic Lookup
ja_jp: プログラムによるルックアップで取得できる Bean を宣言的に選択する

source: Declare a CDI producer method that will define the default session as either PostgreSQL or Oracle, depending on what is active.
ja_jp: アクティブなデータソースに応じて、PostgreSQL または Oracle のいずれかを デフォルトのセッションとして定義する CDI プロデューサーメソッドを宣言します。

source: Declare a CDI producer method to define the default datasource. It selects either PostgreSQL or Oracle, depending on which one is active.
ja_jp: デフォルトのデータソースを定義するCDIプロデューサー・メソッドを宣言します。これは、PostgreSQL または Oracle のいずれかを選択します。

source: Declare a CDI producer method to define the default session. It selects either PostgreSQL or Oracle, depending on which persistence unit is active.
ja_jp: デフォルトのセッションを定義する CDI プロデューサーメソッドを宣言します。これは、どの永続化ユニットがアクティブかに応じて、PostgreSQL または Oracle のいずれかを選択します。

source: Declare a `POST {urlbase}/caches` route handled by the given handler
ja_jp: 与えられたハンドラーによって処理される `POST {urlbase}/caches` ルートを宣言します。

source: Declare a build-time `info:devQuteInfos` DEV template value
ja_jp: ビルドタイム `info:devQuteInfos` DEVテンプレート値を宣言します。

source: Declare a callback `/login` path.
ja_jp: コールバック用の `/login` パスを宣言します。

source: Declare a method that gives us a `TemplateInstance` for `templates/ItemResource/item.html` and declare its `Item item` parameter so we can validate the template.
ja_jp: `templates/ItemResource/item.html` に対して `TemplateInstance` を与えるメソッドを宣言し、その `Item item` パラメーターを宣言することで、テンプレートを検証することができます。

source: Declare a run-time dev `info:cacheInfos` template value
ja_jp: ランタイム dev `info:cacheInfos` テンプレート値を宣言します。

source: Declare an observer of the `StartupEvent` - the scope of the bean does not matter in this case:
ja_jp: `StartupEvent` のオブザーバーを宣言します。この場合、Bean のスコープは重要ではありません。

source: Declare one `public static native TemplateInstance method();` per template file for your resource.
ja_jp: リ ソ ース のテ ン プ レー ト フ ァ イ ルごとに `public static native TemplateInstance method();` を 1 つずつ宣言 し ます。

source: Declare that our hypothetical tutorial will take about 30 minutes to complete.
ja_jp: 架空のチュートリアルが完了するまでに約 30 分かかることを宣言します。

source: Declare that our nonsensical acme extension also requires a container runtime.
ja_jp: 無意味な acme エクステンションにもコンテナーランタイムが必要であることを宣言します。

source: Declare the `cassandra-quarkus-mapper-processor` annotation processor. With Maven, this is done by modifying the compiler plugin configuration in the project's `pom.xml` file as follows:
ja_jp: `cassandra-quarkus-mapper-processor` アノテーション・プロセッサーを宣言します。Mavenでは、プロジェクトの `pom.xml` ファイルのコンパイラ・プラグイン設定を以下のように変更することで実現出来ます:

source: Declare the `java-driver-mapper-runtime` dependency in compile scope in the project's `pom.xml` file as follows:
ja_jp: プロジェクトの `pom.xml` ファイルのコンパイルスコープで `java-driver-mapper-runtime` の依存関係を以下のように宣言します：

source: Declare the bean in the _application_ scope
ja_jp: _application_ スコープでの Bean の宣言

source: Declare the bean in the _application_ scope. Spring only detects @Scheduled annotations in beans.
ja_jp: _application_ スコープでBeanを宣言します。SpringはBeanの @Scheduled アノテーションのみを検出します。

source: Declare the entity using xref:hibernate-orm-panache.adoc[Panache]
ja_jp: link:hibernate-orm-panache.html[Panache]を使ってエンティティを宣言

source: Declare the headless component in your extension:
ja_jp: エクステンションでヘッドレスコンポーネントを宣言します。

source: Declare the root HTTP path.
ja_jp: ルートHTTPパスを宣言します。

source: Declared `@ShutdownDelayInitiated` methods are always executed and as such may block the shutdown procedure.
ja_jp: 宣言された `@ShutdownDelayInitiated` メソッドは常に実行され、シャットダウン手順をブロックする可能性があります。

source: Declares a type-safe template with the Java record.
ja_jp: Java レコードを使用してタイプセーフなテンプレートを宣言します。

source: Declares a type-safe template with the Java record. The template is located at `/src/main/resources/templates/HelloResource/Hello.html`.
ja_jp: Java レコードを使用してタイプセーフなテンプレートを宣言します。テンプレートは `/src/main/resources/templates/HelloResource/Hello.html` にあります。

source: Declares an injection point of type `InterceptionProxy<MyClass>`. This means that at build time, a subclass of `MyClass` is generated that does the interception and forwarding. Note that the type argument must be identical to the return type of the producer method.
ja_jp: `InterceptionProxy<MyClass>` 型の注入ポイントを宣言します。 つまり、ビルド時に、インターセプトと転送を行う `MyClass` のサブクラスが生成されます。 型引数はプロデューサーメソッドの戻り値の型と同じである必要があることに注意してください。

source: Declares custom headers that clients can include in requests.
ja_jp: クライアントがリクエストに含めることができるカスタムヘッダーを宣言します。

source: Declares the web socket endpoint and configure the path. Note that the path can contain a path parameter: `username`.
ja_jp: Web ソケットのエンドポイントを宣言し、パスを設定します。パスにはパスパラメーター `username` を含めることができる点に注意してください。

source: Declaring Selected Alternatives
ja_jp: 選択された代替の宣言

source: Declaring URI parameters
ja_jp: URI パラメーターの宣言

source: Declaring `@BindingsSource`
ja_jp: `@BindingsSource` の宣言

source: Declaring a CDI Bean in the Application scope. Quarkus will create a single instance of this class.
ja_jp: アプリケーションスコープでCDI Beanを宣言します。Quarkusはこのクラスのインスタンスを1つ作成します。

source: Declaring a WebSocket endpoint
ja_jp: WebSocket エンドポイントの宣言

source: Declaring a conditional dependency in the Quarkus extension descriptor
ja_jp: Quarkusエクステンション記述子での条件付き依存関係の宣言

source: Declaring a dependency as `optional`
ja_jp: 依存関係を 'オプション' として宣言

source: Declaring a logger field
ja_jp: ロガー・フィールドの宣言

source: Declaring additional beans
ja_jp: 追加 Bean の宣言

source: Declaring capabilities
ja_jp: ケイパビリティの宣言

source: Declaring conditional capabilities
ja_jp: 条件付きケイパビリティの宣言

source: Declaring endpoints: HTTP methods
ja_jp: エンドポイントの宣言: HTTP メソッド

source: Declaring endpoints: URI mapping
ja_jp: エンドポイントの宣言:URI マッピング

source: Declaring endpoints: representation / content types
ja_jp: エンドポイントの宣言: 表現/コンテンツタイプ

source: Declaring reactive routes
ja_jp: Reactive Routesの宣言

source: Declaring the mechanism an alternative bean ensures this mechanism is used rather than `OidcAuthenticationMechanism` and `JWTAuthMechanism`.
ja_jp: メカニズムを代替Beanとして宣言することで、 `OidcAuthenticationMechanism` や `JWTAuthMechanism` ではなく、このメカニズムが使用されることが保証されます。

source: Decode ID token claims and get a user name.
ja_jp: ID トークンクレームをデコードし、ユーザー名を取得します。

source: Decoration of built-in beans, such as `Event`, is not supported
ja_jp: `Event` などのビルトイン Bean の装飾はサポートされていません

source: Decorators
ja_jp: デコレーター

source: Decorators are similar to interceptors, but because they implement interfaces with business semantics, they are able to implement business logic.
ja_jp: デコレーターはインターセプターと似ていますが、ビジネスセマンティクスを持つインターフェイスを実装しているため、ビジネスロジックを実装することができます。

source: Decorators can inject other beans.
ja_jp: デコレーターは、他のBeanを注入することができます。

source: Decoupled authorization
ja_jp: 分離された認可

source: Decrypt ID token if this property is `true` or if `quarkus.oidc.token.decryption-key-location` is set
ja_jp: このプロパティーが `true` であるか、 `quarkus.oidc.token.decryption-key-location` が設定されている場合に ID トークンを復号化する

source: Decrypt access token
ja_jp: アクセストークンの復号化

source: Decrypt the cookie value using the OIDC tenant's client secret.
ja_jp: OIDC テナントのクライアントシークレットを使用して Cookie 値を復号化します。

source: Decryption Key identifier. If it is set then the decryption JWK key as well every JWT token must have a matching `kid` header.
ja_jp: 復号化キー識別子。設定されている場合、復号化 JWK キーとすべての JWT トークンには、一致する `kid` ヘッダーが必要です。

source: Decryption algorithm.
ja_jp: 復号化アルゴリズム。

source: Decryption key location
ja_jp: 復号キーの場所

source: Decryption key supplied as a string.
ja_jp: 文字列として提供される復号化キー。

source: Deep nesting (`====== Level 4`, `====== Level 5`) should be avoided whenever possible. If you end up with deeply nested sections, think about the following:
ja_jp: 深い入れ子 ( `====== Level 4` 、 `====== Level 5` ) は、可能な限り避ける必要があります。深くネストされたセクションになってしまった場合は、次のことを考慮してください。

source: Default
ja_jp: デフォルト

source: Default Beans
ja_jp: デフォルトの Bean

source: Default Bundle Name
ja_jp: デフォルトのバンドル名

source: Default Output
ja_jp: デフォルト出力

source: Default Profiles
ja_jp: デフォルトのプロファイル

source: Default Runtime Profile
ja_jp: デフォルトの実行時プロファイル

source: Default TokenStateManager
ja_jp: デフォルトの TokenStateManager

source: Default Value
ja_jp: デフォルト値

source: Default Values
ja_jp: デフォルト値

source: Default `TokenStateManager` keeps tokens in an encrypted session cookie by default. Encrypting the tokens increases the session cookie size - you might want to consider disabling the session cookie encryption when the Quarkus application and its clients all operate within an internal, secure network.
ja_jp: デフォルトの `TokenStateManager` は、トークンを暗号化されたセッション Cookie に保持します。トークンを暗号化するとセッション Cookie のサイズが大きくなります。Quarkus アプリケーションとそのクライアントがすべて内部のセキュアなネットワーク内で動作している場合は、セッション Cookie の暗号化の無効化を検討してもよいでしょう。

source: Default and named clients
ja_jp: デフォルトクライアントと名前付きクライアント

source: Default and named connections
ja_jp: デフォルト接続と名前付き接続

source: Default beans
ja_jp: デフォルトのBean

source: Default beans can optionally declare `@jakarta.annotation.Priority`. If there is no priority defined, `@Priority(0)` is assumed. Priority value is used for bean ordering and during typesafe resolution to disambiguate multiple matching default beans.
ja_jp: デフォルトの Bean はオプションで `@jakarta.annotation.Priority` を宣言できます。 優先度が定義されていない場合は、 `@Priority (0)` が想定されます。 優先度の値は、Bean の順序付けと、複数の一致するデフォルト Bean の曖昧さを解消するための型安全な解決に使用されます。

source: Default behaviors:
ja_jp: デフォルトの動作:

source: Default cache key
ja_jp: デフォルトのキャッシュキー

source: Default content types
ja_jp: デフォルトのコンテンツタイプ

source: Default datasource
ja_jp: デフォルトのデータソース

source: Default delay for reconsume failure-strategy, in seconds
ja_jp: リコンシューム失敗戦略のデフォルト遅延時間（秒

source: Default execution mode
ja_jp: デフォルトの実行モード

source: Default header factory
ja_jp: デフォルトのヘッダーファクトリー

source: Default header name is `X-CSRF-TOKEN`, you can customize it with `quarkus.csrf-reactive.token-header-name`, for example:
ja_jp: デフォルトのヘッダー名は `X-CSRF-TOKEN` で、 `quarkus.csrf-reactive.token-header-name` でカスタマイズできます。例:

source: Default header name is `X-CSRF-TOKEN`, you can customize it with `quarkus.rest-csrf.token-header-name`, for example:
ja_jp: デフォルトのヘッダー名は `X-CSRF-TOKEN` です。 `quarkus.rest-csrf.token-header-name` などでカスタマイズできます：

source: Default key resolver refreshes `JsonWebKey` set containing the keys which involves a remote call to the OIDC endpoint
ja_jp: デフォルトのキーリゾルバーが、OIDCエンドポイントへのリモートコールを伴うキーを含む `JsonWebKey` セットを更新します

source: Default masked headers
ja_jp: デフォルトのマスク済みヘッダー

source: Default media type is now JSON
ja_jp: デフォルトのメディアタイプがJSONになりました

source: Default media types
ja_jp: デフォルトのメディアタイプ

source: Default on config pojo should behave the same if set in `src/main/resources/application.yaml` https://github.com/quarkusio/quarkus/issues/13423[#13423]
ja_jp: `src/main/resources/application.yaml` で設定した場合、pojoの設定上のデフォルトは同じ動作をするべき。 link:https://github.com/quarkusio/quarkus/issues/13423[#13423]

source: Default priority
ja_jp: デフォルトの優先度

source: Default providers
ja_jp: デフォルトのプロバイダ

source: Default resolution can also work for Bearer token authentication. Still, it might be less practical because a tenant identifier must always be set as the last path segment value.
ja_jp: デフォルトの解決は、ベアラートークン認証にも機能します。 ただし、テナント識別子は常に最後のパスセグメント値として設定する必要があるため、あまり実用的ではない可能性があります。

source: Default route order (i.e. Static Resources, Servlet).
ja_jp: デフォルトのルート順序（すなわち、静的リソース、サーブレット）。

source: Default schema (`src/main/resources/database/default/V1.0.0__create_fruits.sql`):
ja_jp: デフォルトスキーマ ( `src/main/resources/database/default/V1.0.0__create_fruits.sql` )。

source: Default style
ja_jp: デフォルトスタイル

source: Default to Java 17-based builder images for native executable generation
ja_jp: ネイティブ実行可能ファイルを生成するために、Java 17ベースのビルダーイメージをデフォルトで使用します。

source: Default token cache clean up time interval
ja_jp: デフォルトのトークンキャッシュクリーンアップ時間間隔

source: Default token cache size
ja_jp: デフォルトのトークンキャッシュサイズ

source: Default token cache time-to-live
ja_jp: デフォルトのトークンキャッシュの有効期間

source: Default value
ja_jp: デフォルト値

source: Default value: `descriptor_set.dsc`
ja_jp: デフォルト値: `descriptor_set.dsc`

source: Default values
ja_jp: デフォルト値

source: Default values are subject to change. Use the `--dry-run` option to see the computed value.
ja_jp: デフォルト値は変更される可能性があります。計算された値を確認するには、 `--dry-run` オプションを使用してください。

source: Defaults
ja_jp: デフォルト

source: Defaults for the different parts are as follows:
ja_jp: 各部のデフォルトは以下の通りです。

source: Define Prerequisites
ja_jp: 前提条件の定義

source: Define Your Configuration Interface.
ja_jp: 設定インターフェースを定義します。
